# GetRoofStyle

## Description
Gets the Roof Style of a roof.

```pascal
FUNCTION GetRoofStyle(roof : HANDLE) : LONGINT;
```

```python

def vs.GetRoofStyle(roof):
    return LONGINT
```

## Parameters
|Name|Type|Description|
|---|---|---|
|roof|HANDLE|The roof.|

## Returns
The ref number of the Roof Style of the roof. 0 for unstyled.

## See Also
VS Functions:
SetRoofStyle

## Version
Availability: from Vectorworks 2016
## Category
* Objects - Roofs